## Data cleaning: handling missing values, removing duplicates, and changing data types

In [1]:
# Import Pandas
import pandas as pd

In [2]:
# Read the data from the csv "sample_data.csv"
df=pd.read_csv('sample_data.csv')

In [3]:
# Check for missing values
print(df.isnull())

   StudentID   Name    Age  Gender  Score
0      False  False  False   False  False
1      False  False  False   False  False
2      False  False  False   False  False
3      False  False   True   False  False
4      False  False  False   False   True
5      False  False  False   False  False

In [4]:
# Replace NaN values with 0
df.fillna(0)

  StudentID       Name   Age  Gender  Score
0     ST001  Student 1  23.0    Male   85.0
1     ST001  Student 1  23.0    Male   85.0
2     ST002  Student 2  21.0  Female   76.0
3     ST003  Student 3   0.0    Male   91.0
4     ST004  Student 4  24.0  Female    0.0
5     ST005  Student 5  19.0    Male   77.0

In [5]:
# Drop rows with any NaN values
df.dropna()

  StudentID       Name   Age  Gender  Score
0     ST001  Student 1  23.0    Male   85.0
1     ST001  Student 1  23.0    Male   85.0
2     ST002  Student 2  21.0  Female   76.0
5     ST005  Student 5  19.0    Male   77.0

In [6]:
# Check for duplicate rows
df.duplicated()

0    False
1     True
2    False
3    False
4    False
5    False
dtype: bool

In [7]:
# Drop duplicate rows based on all columns
df.drop_duplicates()

  StudentID       Name   Age  Gender  Score
0     ST001  Student 1  23.0    Male   85.0
2     ST002  Student 2  21.0  Female   76.0
3     ST003  Student 3   NaN    Male   91.0
4     ST004  Student 4  24.0  Female    NaN
5     ST005  Student 5  19.0    Male   77.0

In [12]:
# Print the data type of age
print(df['Age'].dtypes)

float64

In [18]:
# Try converting Age datatype from float to int
df = df.dropna()
print(df)
df['Age'].astype(int)

  StudentID       Name   Age  Gender  Score
0     ST001  Student 1  23.0    Male   85.0
2     ST002  Student 2  21.0  Female   76.0
5     ST005  Student 5  19.0    Male   77.0

0    23
2    21
5    19
Name: Age, dtype: int32